
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ Мелехов (фрагмент ДОБАВЛЕН) 28.04.2026 10:35:58 #5472
	Если Параметры.Свойство("Файл") И Параметры.Свойство("Формат") И Параметры.Свойство("Заявка") Тогда
		Заявка = Параметры.Заявка;
		Файл = Параметры.Файл;
		Формат = Параметры.Формат;
	КонецЕсли;
	//++ Мелехов 28.04.2026 10:35:58
	
КонецПроцедуры

&НаКлиенте
Процедура РазобратьФайл(Команда)
	
	Если ТипРазбора <> 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОРазбореФайлаЗаявки", ЭтотОбъект);	
		ПоказатьВопрос(Оповещение,
			"Разобрать выбранный файл заявки?",
			РежимДиалогаВопрос.ДаНет,
			0,
			КодВозвратаДиалога.Да,
			"Внимание!"
			);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите тип разбора и повторите попытку.";
		Сообщение.Сообщить();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Новый Структура("Отмена", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОРазбореФайлаЗаявки(Результат, ВыбранныйФайл) Экспорт
	
	//++ Мелехов (фрагмент ДОБАВЛЕН) 18.03.2026 17:56:40 #5472
	Если Результат = КодВозвратаДиалога.Да Тогда
		Закрыть(Новый Структура("Отмена, ТипРазбора", Ложь, ТипРазбора));
	КонецЕсли;
	//++ Мелехов 18.03.2026 17:56:40
 
КонецПроцедуры