
&НаКлиенте
Процедура УдалитьКомментарийИЗакрыть(Команда)
	
	//++ Мелехов (фрагмент ДОБАВЛЕН) 20.01.2023 10:20:01 #2277
	ТекстСообщения = "";
	//++ Мелехов 20.01.2023 10:20:01
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	//++ Мелехов (фрагмент ДОБАВЛЕН) 20.01.2023 10:19:55 #2277
	СохранитьИнформациюНаСервере();
	Закрыть(Новый Структура("Ответ, ТекстСообщения", Истина, ТекстСообщения));
	//++ Мелехов 20.01.2023 10:19:55
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИнформациюНаСервере()
	
	//++ Мелехов (фрагмент ДОБАВЛЕН) 20.01.2023 10:23:02 #2277
	ОбъектЗаявка = Заявка.ПолучитьОбъект();
	
	СтруктураДляПоиска = Новый Структура("ПризнакРазбора", ПризнакРазбора);
	СтруктураДляПоиска.Вставить("ДатаРазбора", ДатаРазбора); 
	СтруктураДляПоиска.Вставить("Наименование", Наименование); 
	СтруктураДляПоиска.Вставить("НомерПозиции", НомерПозиции); 

	ТабличнаяЧастьСпр = ОбъектЗаявка.РазборЗаявкиОтИИ; 
	МассивСтрокРазбора = ТабличнаяЧастьСпр.НайтиСтроки(СтруктураДляПоиска); 
	Если МассивСтрокРазбора.Количество() = 1 Тогда
		МассивСтрокРазбора[0].КомментарийМЗ = ТекстСообщения;
	КонецЕсли;
	
	ОбъектЗаявка.Записать();
	//++ Мелехов 20.01.2023 10:23:02
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ Мелехов (фрагмент ДОБАВЛЕН) 20.01.2023 10:22:13 #2277
	ТекстСообщения = ?(Параметры.Свойство("ТекстСообщения") = Истина, Параметры.ТекстСообщения, "");
	Заявка = ?(Параметры.Свойство("Заявка") = Истина, Параметры.Заявка, Справочники.ЗаявкиОтделаПродажПоЗакупкам.ПустаяСсылка());
	НомерПозиции = ?(Параметры.Свойство("НомерПозиции") = Истина, Параметры.НомерПозиции, 0);
	ПризнакРазбора = ?(Параметры.Свойство("ПризнакРазбора") = Истина, Параметры.ПризнакРазбора, 0);
	Наименование = ?(Параметры.Свойство("Наименование") = Истина, Параметры.Наименование, "");
	ДатаРазбора = ?(Параметры.Свойство("ДатаРазбора") = Истина, Параметры.ДатаРазбора, Дата(1, 1, 1));
	//++ Мелехов 20.01.2023 10:22:13
	
КонецПроцедуры


